           05  RESPONSE.
             10  RESPONSERETCODE                   PIC 9(9).
             10  REASONRETCODE                     PIC 9(9).
             10  RESPONSEMSG                       PIC X(200).

